# Отчет по практической работе N 8 по курсу
# "Фундаментальная информатика"

Студент группы: M8О-115Б-23, Авраменко Денис Александрович\
Контакты: den41k2975@yandex.ru \
Работа выполнена: 20.69.2024\
Преподаватель: Чеснов Илья Игоревич

## 1. Тема

Линейные списки.

## 2. Цель работы

Составить и отладить программу на языке Си для обработки линейного списка заданной организации.

## 3. Задание

Реализовать интовый кольцевой однонаправленный список. Реализовать очистку списка, если в нём есть элемент, равный заданному значению

## 4. Оборудование

Процессор: InAMD Ryzen 7 5800H with Radeon Graphics 3.20 GHz
ОП: 16000 Мб\
НМД: 1024 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **Windows 11**, версия **22H2**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **JetBrains CLion**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**

## 6. Идея, метод, алгоритм решения задачи
Алгоритмов здесь нет

## 7. Сценарий выполнения работы

Да в целом что тут думать. Делаем ноду, делаем 4 базы и 1 до функцию

## 8. Распечатка протокола

```
Вставьте сюда пример работы вашей программы для нескольких тестовых примеров:
Входные данные (запуск и передаваемые аргументы)
appendNode(&head, 10);
printf("Printing the list:\n");
printList(head);
appendNode(&head, 20);
printf("Printing the list:\n");
printList(head);
appendNode(&head, 30);
printf("Printing the list:\n");
printList(head);
appendNode(&head, 40);
printf("Printing the list:\n");
printList(head);

printf("Printing the list:\n");
printList(head);

printf("\nInserting 50 at index 2:\n");
insertNode(&head, 50, 2);
printList(head);

printf("\nDeleting node at index 0:\n");
deleteNode(&head, 0);
printList(head);

printf("\nNumber of nodes: %d\n", countNodes(head));

printf("\nClearing list with value 30:\n");
clearListWithValue(&head, 30);
printList(head);
Вывод программы
Printing the list:
10
Printing the list:
10 20
Printing the list:
10 20 30
Printing the list:
10 20 30 40
Printing the list:
10 20 30 40

Inserting 50 at index 2:
10 20 50 30 40

```

## 9. Дневник отладки

| № | Лаб. или дом. | Дата       | Время     | Событие                  | Действие по исправлению | Примечание  |
|---|---------------|------------|-----------|--------------------------|-------------------------|-------------|
|1  | Дом           | 19.04.2023 | 13:50     | Неправильно написал вставку, была ошибка, когда вставлял элемент на 0й индекс | Стал переподвязывать header | Нужно быть внимательнее |
|2  | Дом           | 19.04.2023 | 02:50     | Не очищал память после удаления ноды | free(ptr) | Забыл |

## 10. Замечания автора по существу работы

Снова реализовали какую-то ссылочную структуру. Но в целом лаба приятная

## 11. Выводы
Сделаны


